lib/tasks/dev.rake

  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do
      coins = [
        {
          description: 'Bitcoin',
          acronym: 'BTC',
          url_image: 'https://cdn-icons-png.flaticon.com/512/6943/6943101.png',
          mining_type: MiningType.find_by(acronym: 'PoW')
        },
        {
          description: 'Ethereum',
          acronym: 'ETH',
          url_image: 'https://cdn-icons-png.flaticon.com/512/6943/6943137.png',
          mining_type: MiningType.all.sample
        },
        {
          description: 'Dash',
          acronym: 'DASH',
          url_image: 'https://cdn-icons-png.flaticon.com/512/6943/6943131.png',
          mining_type: MiningType.all.sample
        },
        {
          description: 'Iota',
          acronym: 'IOT',
          url_image: 'https://cdn-icons-png.flaticon.com/512/6723/6723145.png',
          mining_type: MiningType.all.sample
        },
        {
          description: 'ZCash',
          acronym: 'ZEC',
          url_image: 'https://cdn-icons-png.flaticon.com/512/1490/1490861.png',
          mining_type: MiningType.all.sample
        }
      ]

    coins.each do |coin|
        Coin.find_or_create_by!(coin)
---
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://cdn-icons-png.flaticon.com/512/6943/6943101.png"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."description" = ? AND "mining_types"."acronym" = ? LIMIT ?  [["description", "Proof of Work"], ["acronym", "PoW"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineiração...") do
      mining_types = [
        {
          description: "Proof of Work",
          acronym: "PoW",
        },
        {
          description: "Proof of Stake",
          acronym: "PoS"
        },
        {
          description: "Proof of Capacity",
          acronym: "PoC"
        }
      ]
    mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)
---
INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-04-08 20:39:37.425201"], ["updated_at", "2023-04-08 20:39:37.425201"]]