app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://cdn-icons-png.flaticon.com/512/6943/6943101.png"], ["updated_at", "2022-10-08 16:10:59.886685"], ["id", 3]]

  def destroy
    @coin.destroy
---
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 1]]

    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"