app/controllers/mining_types_controller.rb

  def index
    @mining_types = MiningType.all
---
SELECT "mining_types".* FROM "mining_types"

  def create
    @mining_type = MiningType.new(mining_type_params)

    respond_to do |format|
      if @mining_type.save
---
INSERT INTO "mining_types" ("name", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-04-02 19:51:53.053206"], ["updated_at", "2023-04-02 19:51:53.053206"]]

  def update
    respond_to do |format|
      if @mining_type.update(mining_type_params)
---
UPDATE "mining_types" SET "description" = ?, "updated_at" = ? WHERE "mining_types"."id" = ?  [["description", "Proof of Capacitys"], ["updated_at", "2023-04-08 19:15:03.038191"], ["id", 3]]

    def set_mining_type
      @mining_type = MiningType.find(params[:id])
---
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]