app/views/layouts/application.html.erb

                <span class="position-absolute top-0 start-100 translate-middle badge rounded-pill bg-primary mt-2">
                  <%= Coin.count > 9 ? '9+' : Coin.count %>
---
SELECT COUNT(*) FROM "coins"

                <span class="position-absolute top-0 start-100 translate-middle badge rounded-pill bg-primary mt-2">
                  <%= MiningType.count > 9 ? '9+' : MiningType.count %>
---
SELECT COUNT(*) FROM "mining_types"