app/views/coins/_form.html.erb

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    <%= form.label :mining_type_id %>
    <%= form.select('mining_type_id', MiningType.all.collect{|m| [ m.description, m.id ]}, { include_blank: 'Selecione' } ) %>