app/views/coins/edit.html.erb

<h1><%= "#{Coin.model_name.human(count: Coin.count)} - #{t('links.edit')}" %></h1>
---
SELECT COUNT(*) FROM "coins"