app/views/coins/index.html.erb

SELECT "coins".* FROM "coins"
SELECT COUNT(*) FROM "coins"
---

<h1><%= Coin.model_name.human(count: Coin.count) %></h1>